{
  "game_name": "wild_west_showdown",
  "game_domain": "wild_west_showdown",
  "project_type": "ige5_game",
  "game_url": "",
  "default_resolution": [
    390,
    844
  ],
  "include": [
    "assets",
    "src",
    "public",
    "package.json",
    ".babelrc",
    "volter.json",
    "Dockerfile",
    "build.sh"
  ],
  "run_commands": "BROWSER=none bun start",
  "default_port": 8000,
  "description": "Wild West Showdown is a thrilling multiplayer IO game where players become gunslingers in a frontier town, battling it out to be the last one standing.",
  "page_body": "Welcome to Wild West Showdown, a multiplayer IO game set in the untamed wild west. Step into the boots of a gunslinger and compete against others in a frontier town. \n\nCore Gameplay: \n- Control your gunslinger in a top-down 2D environment. \n- Move around the map to collect weapons, power-ups, and gold. \n- Engage in intense shootouts using a variety of wild west weapons. \n- Be the last gunslinger standing to win the round. \n\nFeatures: \n- Choose from multiple character types, each with unique abilities: Sheriff, Outlaw, Bounty Hunter. \n- Arm yourself with revolvers, shotguns, rifles, and dynamite. \n- Utilize power-ups like speed boost, quick reload, and extra health. \n- Navigate environmental hazards such as stampeding cattle, mine cart tracks, and saloon brawls. \n- Collect gold to purchase upgrades between rounds. \n- Experience a dynamic day/night cycle that affects visibility and gameplay. \n\nMultiplayer: \n- Engage in matches with 4-8 players. \n- Bot players fill empty slots to ensure full games. \n- Use the lobby system to wait between rounds. \n- Climb the leaderboard to become the top gunslinger. \n\nGame Modes: \n- Deathmatch: Be the last gunslinger standing. \n- Gold Rush: Collect the most gold within the time limit. \n- Wanted: Play as the sheriff or survive as an outlaw. \n\nUI Elements: \n- Keep track of your health with the health bar. \n- Monitor your ammo with the ammo counter. \n- See how much gold you've collected. \n- Use the mini-map to locate other players. \n- Keep an eye on the timer for round duration. \n\nJoin the Wild West Showdown and prove your mettle as the ultimate gunslinger!"
}
